final List<String> ukrainianNames1 = [
  'Андрій', 'Богдан', 'Василь', 'Віктор', 'Григорій',
  'Дмитро', 'Євген', 'Захар', 'Іван', 'Йосип',
  'Костянтин', 'Леонід', 'Максим', 'Назар', 'Олег',
  'Петро', 'Роман', 'Степан', 'Тарас', 'Федір',
  'Юрій', 'Ярослав', 'Олександр', 'Микола', 'Сергій',
  'Марія', 'Наталія', 'Оксана', 'Ольга', 'Софія',
  'Анна', 'Вікторія', 'Галина', 'Дарина', 'Євгенія',
  'Зоряна', 'Ірина', 'Катерина', 'Лариса', 'Людмила',
  'Надія', 'Поліна', 'Руслана', 'Світлана', 'Тетяна',
  'Уляна', 'Христина', 'Юлія', 'Яна', 'Валентина'
];

final List<String> ukrainianNames2 = [
  'Богдан', 'Василь', 'Віталій', 'Володимир', 'Геннадій',
  'Данило', 'Едуард', 'Єгор', 'Зеновій', 'Ігор',
  'Кирило', 'Любомир', 'Михайло', 'Нестор', 'Остап',
  'Павло', 'Ростислав', 'Святослав', 'Тимофій', 'Устим',
  'Хома', 'Юхим', 'Яків', 'Арсен', 'Борис',
  'Анастасія', 'Богдана', 'Валерія', 'Ганна', 'Діана',
  'Емілія', 'Жанна', 'Злата', 'Інна', 'Лідія',
  'Маргарита', 'Ніна', 'Олена', 'Раїса', 'Соломія',
  'Таїсія', 'Уляна', 'Фаїна', 'Христина', 'Юлія',
  'Ярина', 'Віра', 'Любов', 'Надія', 'Мирослава'
]; 